do

function run(msg, matches)

return 'نرخ گروه با بات'..[[
 
-----------------
➖➖➖➖➖➖➖
👥 قیمت گروه های آنتی اسپم که ربات بسازه گروهو :
  
  💵 ماهیانه سوپرگروه 5000 تومان
  💴 دو ماهه سوپرگروه 9000 تومان
  💶 سه ماهه سوپرگروه 13،000 تومان
  
➖➖➖➖➖➖➖
👥 قیمت گروه های آنتی اسپم که خودتون گروه داشته باشین :

💵 ماهیانه سوپرگروه 3000 تومان
💴 دو ماهه سوپرگروه 7000 تومان
💶 سه ماهه سوپرگروه 10،000 تومان
➖➖➖➖➖➖➖
قیمت نصب و راه اندازی ربات بدون سرور:
💵10،000 تومان
➖➖➖➖➖➖➖
قیمت نصب و راه اندازی ربات همراه با سرور:(یوزر روت تحویل شما میشود)
💵 30،000 تومان
➖➖➖➖➖➖➖
سورس کاملا فارسی و اختصاصی ربات
💵 15،000 تومان
➖➖➖➖➖➖➖
👾نازلترین قیمت ها در این کانال ارائه داده میشود
➖➖➖➖➖➖➖
  
  برای سفارش به آیدی زیر پیام دهید : 

@GoogleProgrammer

اونایی که ریپورتن:

@Mr_MtinxBot
➖➖➖➖➖➖➖
پشتیبانی 24 ساعت ربات و گروه شما توسط بنده انجام میشود❤ @TURBO_TM
end
return {
patterns = {
    "^[Nn]erkh$",
    "^[!/#]nerkh$",
    "^[Cc]reategroup",
    "^[!/#]creategroup",
    "^نرخ$",
    "^گروه میخام$",
},
run = run
}

end
